# St7GetPlateLabelStyle

Returns the display style for plate labels.

Plate Entity Display

long St7GetPlateLabelStyle(long uID, long* LabelStyle)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
LabelStyle

One of lsNone, lsEntityNumber, lsIDNumber, lsPropertyNumber, lsPropertyName or lsPropertyType.